<?php
/**
 * Created by PhpStorm.
 * User: wzj-dev
 * Date: 18/1/15
 * Time: 下午9:32
 */

namespace app\spiderConst;


class ChineseEnum
{
    public static $enumToHighSchoolVersion = [  //高中语文教材版本
        27 => '人教版',
        29 => '苏教版',
        31 => '鄂教版',
        33 => '语文版',
        35 => '鲁人版',
    ];

    public static $enumToHighSchoolRJBModule = [   //高中语文人教版模块
        1000001 => '必修1',
        1000023 => '必修2',
        1000025 => '必修3',
        1000027 => '必修4',
        1000029 => '必修5',
        1000031 => '中国古代诗歌散文欣赏',
        1000033 => '中国小说欣赏',
        1000035 => '外国小说欣赏',
        1000061 => '一轮复习',
    ];

    public static $enumToHighSchoolSJBModule = [    //高中苏教版模块
        1004605 => '必修1',
        1004607 => '必修2',
        1004611 => '必修3',
        1004617 => '必修4',
        1004621 => '必修5',
        1019471 => '唐诗宋词选读',
        1020677 => '现代散文选读',
        1021357 => '《史记》选读',
        1049797 => '一轮复习',
    ];

    public static $enumToHighSchoolEJBModule = [    //高中鄂教版模块
        1009015 => '必修1',
        1009021 => '必修2',
        1009023 => '必修3',
        1009025 => '必修4',
        1009027 => '必修5',
        1050337 => '一轮复习',
    ];

    public static $enumToHighSchoolYWBModule = [    //高中语文版模块
        1012671 => '必修1',
        1012681 => '必修2',
        1012691 => '必修3',
        1012705 => '必修4',
        1012719 => '必修5',
        1050355 => '一轮复习',
    ];

    public static $enumToHighSchoolLRBModule = [    //高中鲁人版模块
        1014779 => '必修1',
        1014783 => '必修2',
        1014785 => '必修3',
        1014787 => '必修4',
        1014791 => '必修5',
        1050373 => '一轮复习',
    ];
}